#include "Library.h"
using namespace std;

void background() {
	setlocale(LC_ALL, "RU");

	cout << endl << "Однажды, в незапамятные времена, жили люди, эльфы, орки, гномы и множество других рас в так называемом верхнем мире. Это было так давно, что упоминания о верхнем мире." << endl;
	cout << "Сейчас это скорее сказки для наших детей, которые живут здесь и сейчас - в Андерленде. А сам этот мир, скорее даже не мир, а пространтсво между Старым, Верхним миром, и преисподней." << endl;
	cout << "Это место абсолютной тьмы и пустоты. Сам мир систоит из огромных колонн, высотой, порой достигающих от самого низа, до самого верха. А сделаны они из божественного камня, " << endl;
	cout << "который залаживали еще сами демиурги, создатели миров, с целью постоянного поддержания целостности мира. Иначе, если колонны разрушаться, разрушится равновесие на уровне мироздания " << endl;
	cout << "и случится так называемый катаклизм - соединение Верхнего мира и Преисподней, что в свою очередь способно вызвать цепную реакцию, уничтожив и остальные миры и их наместников." << endl;
	cout << "То есть богов. И останется лишь пустота, среди бескрайней Вселенной." << endl;

	system("pause");

	cout << endl << "Дак как же так получилось, что мы попали в столь забытое богами место. Пророчество, написанное во времена строительства первых городов верхнего мира, гласило, что если руки одной из великих на то время рас" << endl;
	cout << "будут запачканы в крови, то произойдет Великое Переселение. Что это значило, никто на то время не знал, но пророчеству придерживались все. Правда со временем его начали забывать. Спустя столетия было возведено бесчиленное количество городов." << endl;
	cout << "Всё оставалось мирным, до, так называемого, Великого предательства. Люди, как им свойственно по природе, крайне коварны и жадны. Они долго готовились к великой войне народов, в сердце их гремели звуки надвигающегося шторма." << endl;
	cout << "А кожу пронизывал адреналиновый холод. Тогда началась, пожалуй самая масштабная, кровопролитная, а главное безжалостная война в истории нашей расы. Были убиты миллионы невинных, сожжены десятки городов до тла." << endl;
	cout << "Те кто выжили, бежали прочь, находя приют в горах. Завоевания длились порядка семи лет. За это время была уничтожена столица эльфов Нис'Арг и сожжено древо жизни Антарес, замурована вместе с ее жителями столица гномов Гаренварг." << endl;
	cout << "Люди, почувствовав вкус крови, возомнили себя богами. Отныне они были способны диктовать правила этому миру. Но произошло непоправимое..." << endl;

	system("pause");

	cout << endl << "Вдоволь насытившись чужой крови, внезапно пришло осознание содеянного. Люди и другие народы вспомнили древнее предание. И начался хаос в рядах людей. Следовали революции, суды, гражданские войны шли одна за одной." << endl;
	cout << "В конечном итоге это привело к тому, что люди, по велению высших богов, были отправлены в то самое Великое переселение на неопределенный срок. Если коротко говоря - весь народ человеческий был изгнан в Андерленд - " << endl;
	cout << "пространство страха и боли, тьмы и пустоты, горя и отчаяния. Этот мир является некой гробницей великих рас, которые были изгнаны из своих миров за неповиновение Высшим богам. А так же это место было и кладбищем тех самых великих рас." << endl;
	cout << "Среди них: Архитекторы - творцы пространства-времени, Предтечи - одна из самых древнейших рас-завоевателей, а также те самые Демиурги - создатели древнейших миров." << endl;
	cout << "Отсюда и началась история изгнания и становления человечества, как самой противоречивой расы во всей Вселенной." << endl;

	cout << endl;
	
	return;
}

void cultistDiary() {
	setlocale(LC_ALL, "RU");

	cout << endl << "Большая часть страниц была написана на неведомом мне языке. Но местами попадались и на столичном:" << endl;
	cout << "Новый день - новые заботы. Сегодня верховный пастырь провел службу кровопускания. В жертву взяли восьмимесячного ребенка, которого буквально вчера украли из очередного дома." << endl;
	cout << "Это уже пятое по счету жертвоприношение, осталось семь и тогда... Этот мир узрит гнев семи стражей! Эти жалкие выродки, называющие себя людьми поймут, кто их истинный хозяин!" << endl;
	cout << "Антрахиль падет под гнетом истинной магии скверны. Человечество узрит каково быть в изгнании!" << endl;

	system("pause");

	cout << endl << "Далее текст прерывается и начинается новый, спустя несколько страниц." << endl;
	cout << "Нами заинтересовалась стража. Еще бы, мы увели из-под носа новорожденного сына офицера. Сегодня приходило пятеро солдат, пытаясь отыскать нас. Они явно думали, что им" << endl;
	cout << "предстоит стражаться с каким-нибудь угом или другой тварью, которая непротив попитаться человеческим дерьмом. Ну если кратко, то мы устроили засаду на них и вспороли животы" << endl;
	cout << "каждому, затем их съели и кровью окропили наших воинов." << endl;

	system("pause");

	cout << endl << "Далее текст опять прерывается и продолжается в самом конце дневника." << endl;
	cout << "Мы не знаем что это. Вчера пастыря поразила некая хворь. А уже сегодня Он не мог встать сам и из живота сыпался... Прах? Никто не знает что это, но заболело уже порядка семи" << endl;
	cout << "человек. У всех одни и те же симптомы: кашель, рвота, головная боль и обезвоживание." << endl << endl;

	system("pause");

	cout << endl << "О нет... Из шестидесяти двух жителей нашей общины, в живых осталось лишь четверо. Мертвые начали восставать и кидаться на других. Словно все заболели чумой или красной" << endl;
	cout << "гнилью. Мы спрятались в малом покое проведения ритуалов и забаррикодировали вход. Выходить на улицу равносильно смерти, а баррикады способны выстоять еще долго. Только вот" << endl;
	cout << "еды почти нету. Наверное будем отрезать от себя по куску плоти, чтобы хоть как-то прожить. Стены тем временем начали покрывать какой-то сльзью, от которой несет... Смертью?" << endl;
	cout << "Точно такой же запах был при ритуалах очищения. Видать стражам было мало жертв и они избрали нас. Хвала тьме!" << endl;
	
	cout << endl;

	return;
}
